# Лабораторная работа №3
<p><b>Цели и задачи работы:</b>
Изучение циклических алгоритмов, операторов цикла, программирование циклического вычислительного процесса.
<b>Задание к работе:</b>
1.Вычислить и вывести на экран или в файл в виде таблицы значения функции, заданной графически, на интервале от Xнач до Xкон с шагом dx. Интервал и шаг задать таким образом, чтобы проверить все ветви программы. Таблица должна иметь заголовком и шапку.
2. Тесты на простоту (реализовать метод перебора делителей, тесты Миллера, Поклингтона, ГОСТ Р 34.10-94
3*. Решить задачу об остывании чашки кофе из кофейни НГТУ. Написать программу, моделирующую процесс остывания кофе. Программа должна позволять задавать все необходимые параметры. Построить графики или таблицы зависимостей величин. Считаем, что температуру кофе измеряли через некоторые, необязательно равномерные промежутки времени. Написать программу, которая бы по данным измерений строила линейную модель, вычисляя статистические критерии их адекватности
</p>

<h2>Пример работы:</h2>
<p>Как было сказано выше, суть этой работы это представить решение индивидуальной задачи на 11 ЯП. В качестве примера, разберём работу на ЯП <em>C++</em>:</p>

```cpp

#include <iostream>
#include <regex> // Regular Expressions - позволяет делать шаблон для поиска.
#include <string>

using namespace std;

int main() {
    string str = "101tf11flb10001";
    regex pattern("10+1"); // Шаблон для поиска подстрок "1[0]1"

    sregex_iterator begin(str.begin(), str.end(), pattern);
    sregex_iterator end;

    while (begin != end) {
        smatch match = *begin;
        cout << match.str() << endl;
        ++begin;
    }

    return 0;
}
```
<p>В данном коде нам представлено решение задачи под номером 1: </p>
< <p>Дана строка S. Необходимо найти ее подстроки, которые удовлетворяют шаблону вида 1[0]1, где [0] – любое количество нулей (минимально - один). В последовательности [0] не может быть никаких других символов, кроме 0. Пример: str=”101tf11flb10001”. Результат: 101, 10001</p> >
<p>Для решения этой задачи, я решил воспользоваться такой полезной, но к сожалению недооценённой вещью в си++, называемую "Regex(Регулярные выражения)". Проще говоря, это инструмент облегчающий кодеру сортировать, вытягивать из строки и прочее. Написав "regex pattern("10+1");" я создал шаблон, благодаря которому из строки набором "101tf11flb10001" позволит нам вытащить следуюющее:</p>

```
101
10001
```
<p>Следующее что стоит сказать, это то, что этот код нам следует <em>перевести на 10 остальных.</em></p>
<b>На этом всё друзья! Наслаждайтесь моим маленьким королевством!</b>
